In [ ]:
# 외부 라이브러리 설치
|pip install pandas

In [5]:
# 라이브러리 로드
import pandas as pd

In [6]:
# Series의 형태
# pd.Series()
pd_list = pd.Series(
    [5000, 6000, 6500, 6500],
    ['아메리카노', '카페라떼', '카페모카', '카푸치노']
    )

In [7]:
print(pd_list)

아메리카노    5000
카페라떼     6000
카페모카     6500
카푸치노     6500
dtype: int64

In [8]:
# values값과 index값을 따로 출력
print("Series의 value = ", pd_list.values)
print("Series의 index = ", pd_list.index)

Series의 value =  [5000 6000 6500 6500]
Series의 index =  Index(['아메리카노', '카페라떼', '카페모카', '카푸치노'], dtype='object')

In [9]:
pd_list.index = [1, 2, 3, 4]

In [10]:
print(pd_list)

1    5000
2    6000
3    6500
4    6500
dtype: int64

In [11]:
# 데이터프레임 형태의 데이터 생성
values = [{1, 2, 3}, {4, 5, 6}, {7, 8, 9}]

df = pd.DataFrame(values)

In [13]:
print(df)

   0  1  2
0  1  2  3
1  4  5  6
2  8  9  7

In [14]:
# 데이터프레임에서 print 안쓰는 이유 -> 더 잘 나옴.
df

   0  1  2
0  1  2  3
1  4  5  6
2  8  9  7

In [15]:
# index 값을 변경 a, b, c
# column 값을 변경 A, B, C
df.index = ["a", "b", "c"]
df.columns = ["A", "B", "C"]

In [16]:
df

   A  B  C
a  1  2  3
b  4  5  6
c  8  9  7

In [18]:
# 딕셔너리 형태의 데이터를 데이터프레임 형태로 변경
values = {
    "name" : ["A", "B", "C"],
    "age" : [20, 30, 40],
    "phone" : ["01012345678", "01098765432", "01056457869"]
    }

In [19]:
df_2 = pd.DataFrame(values)
df_2

  name  age        phone
0    A   20  01012345678
1    B   30  01098765432
2    C   40  01056457869

In [20]:
# 상단의 행을기준으로 출력하는 head()
# 상단부터 n번까지 출력하는 함수
df_2.head(2)

  name  age        phone
0    A   20  01012345678
1    B   30  01098765432

In [21]:
df_2.tail(2)

  name  age        phone
1    B   30  01098765432
2    C   40  01056457869

In [22]:
# 컬럼을 기준으로 출력
df_2["name"]

0    A
1    B
2    C
Name: name, dtype: object

In [24]:
# Series 형태가 아닌 DataFrame 형태로 출력
df_2[["name", "age"]]

  name  age
0    A   20
1    B   30
2    C   40

# 경로 지정
1. 절대 경로
    - 절대적인 주소
    - url주소, c://users/administrator/a.txt
2. 상대 경로
    - 상대적인 주소
    - './' : 현재 작업중인 폴더
    - '../' : 상위 폴더로 이동
    - './폴더명/' : 하위 폴더로 이동

In [26]:
# read_csv(파일의 위치)
# 상위 폴더로 이동 -> data 하위폴더로 이동 -> 파일 가져오기
# 상대 경로
df = pd.read_csv("../data/example.csv")

# 절대 경로
df2 = pd.read_csv("C:\\Users\\Kim Taemin\\Documents\\GitHub\\python-class\\data\\example.csv")

In [27]:
df

  Name  Gender          Phone
0    A    male  010-1234-5678
1    B  female  010-1234-5679
2    C    male  010-1234-5680
3    D  female  010-1234-5681
4    E    male  010-1234-5682
5    F  female  010-1234-5683
6    G    male  010-1234-5684
7    H  female  010-1234-5685
8    I    male  010-1234-5686
9    J  female  010-1234-5687

In [30]:
# 상대 경로로 csv 폴더 안에 num_2폴더에 있는 drinks.csv 로드
df3 = pd.read_csv("../csv/num_2/drinks.csv")

In [31]:
df3

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF
...,...,...,...,...,...,...
188,Venezuela,333,100,3,7.7,SA
189,Vietnam,111,2,1,2.0,AS
190,Yemen,6,0,0,0.1,AS
191,Zambia,32,19,4,2.5,AF
192,Zimbabwe,64,18,4,4.7,AF

In [32]:
# 결측치
import numpy as np

In [33]:
s1 = pd.Series([1, np.nan, 3, 4, 5])
s2 = pd.Series([1, 2, np.nan, 4, 5])
s3 = pd.Series([1, 2, 3, np.nan, 5])

In [68]:
# Series 형태의 데이터를 데이터프레임으로 합치는 작업
df = pd.DataFrame({
    "s1" : s1,
    "s2" : s2,
    "s3" : s3
})

In [69]:
df

    s1   s2   s3
0  1.0  1.0  1.0
1  NaN  2.0  2.0
2  3.0  NaN  3.0
3  4.0  4.0  NaN
4  5.0  5.0  5.0

In [53]:
# is() : 값이 존재하는지에 대한 bool의 형태로 출력을 해주는 함수
# 결측치를 bool의 형태로 출력을 해주는 함수 : isna()
# 결측치는 True, 결측치가 아니면 False
df.isna()

      s1     s2     s3
0  False  False  False
1   True  False  False
2  False   True  False
3  False  False   True
4  False  False  False

In [54]:
df.isna().sum()

s1    1
s2    1
s3    1
dtype: int64

In [38]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   s1      4 non-null      float64
 1   s2      4 non-null      float64
 2   s3      4 non-null      float64
dtypes: float64(3)
memory usage: 248.0 bytes

In [57]:
# 결측치 제거
# dropna(행을 기준으로 할지 열을 기준으로 할지 지정)
# 매개변수 axis에 0을 대입하면 행을 기준으로 삭제
# 1을 대입하면 열을 기준으로 삭제

df.dropna(axis = 1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

In [58]:
df.dropna(axis = 0)

    s1   s2   s3
0  1.0  1.0  1.0
4  5.0  5.0  5.0

In [65]:
df.dropna(axis = 0, inplace = True)

In [66]:
df

    s1   s2   s3
0  1.0  1.0  1.0
4  5.0  5.0  5.0

In [70]:
# 통계 요약 정보
df. describe()

             s1        s2        s3
count  4.000000  4.000000  4.000000
mean   3.250000  3.000000  2.750000
std    1.707825  1.825742  1.707825
min    1.000000  1.000000  1.000000
25%    2.500000  1.750000  1.750000
50%    3.500000  3.000000  2.500000
75%    4.250000  4.250000  3.500000
max    5.000000  5.000000  5.000000